ninety_nine_cats/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["name", "Snowball 3"], ["updated_at", "2018-09-11 23:38:53.056830"], ["id", 1]]